{
  "pt": {
    "welcome": "Bem-vindo ao site de TSI!",
    "language": "Idioma",
    "navbar": {
      "search": "Buscar",
      "darkMode": "Modo Escuro",
      "toggleNavigation": "Alternar navegação",
      "noResults": "Nenhum resultado encontrado"
    },
    "routes": {
      "home": "Início",
      "about": "Sobre",
      "contacts": "Fale Conosco"
    },
    "footer": {
      "title": "Universidade Tecnológica Federal do Paraná (UTFPR)",
      "description": "A UTFPR é uma instituição de ensino superior voltada à tecnologia e inovação, oferecendo graduação, pós-graduação e pesquisa.",
      "contact": "Contato",
      "address": "R. Cristo Rei, 19 – Vila Becker, Toledo – PR, 85902-490",
      "phone": "(45) 3379-6800",
      "email": "contato@utfpr.edu.br",
      "copyright": "© 2025 Universidade Tecnológica Federal do Paraná. Todos os direitos reservados.",
      "socialMedia": {
        "whatsapp": "Link para o WhatsApp",
        "twitter": "Link para o Twitter",
        "youtube": "Link para o YouTube",
        "instagram": "Link para o Instagram",
        "facebook": "Link para o Facebook",
        "linkedin": "Link para o LinkedIn"
      }
    },
    "languageNames": {
      "pt": "Português 🇧🇷",
      "en": "Inglês 🇺🇸",
      "es": "Espanhol 🇪🇸",
      "fr": "Francês 🇫🇷"
    },
    "aboutPage": {
      "title": "Sobre o curso",
      "subtitle": "Matriz Curricular",
      "paragraph1": "O curso de Tecnologia em Sistemas para Internet (TSI) da UTFPR – Campus Toledo, iniciado em 2014, é um tecnólogo de 3 anos de duração (6 semestres), totalmente gratuito e reconhecido pelo MEC desde 2017.",
      "paragraph2": "Focado no eixo de Informação e Comunicação, o TSI forma profissionais capazes de projetar, implementar e gerenciar sistemas web, incluindo interfaces, aplicativos, marketing eletrônico e intranets.",
      "paragraph3": "A matriz curricular, com cerca de 2.400 horas, inclui atividades práticas, estágio supervisionado (360h) e um Trabalho de Conclusão de Curso (TCC).",
      "paragraph4": "O curso oferece laboratórios de informática com dezenas de estações equipadas para desenvolvimento, além de estrutura de apoio, como biblioteca física e digital, salas de estudo individual e coletivo . Em 2023, o TSI alcançou nota 4 (escala de 1 a 5) na avaliação do MEC, destacando-se pela organização didático-pedagógica, corpo docente qualificado (todos com título de mestre ou doutor e produção científica relevante) e pela infraestrutura de qualidade."
    },
    "contactPage": {
      "title": "Fale conosco",
      "form": {
        "nameLabel": "Nome",
        "namePlaceholder": "Digite seu nome",
        "emailLabel": "Email",
        "emailPlaceholder": "email@exemplo.com",
        "subjectLabel": "Assunto",
        "subjectPlaceholder": "Inicie o assunto!",
        "submitButton": "Enviar"
      }
    },
    "homePage": {
      "title": "O que é a UTFPR?",
      "paragraph1": "A Universidade Tecnológica Federal do Paraná (UTFPR) é uma instituição pública de ensino superior reconhecida nacionalmente pela excelência em educação, pesquisa e inovação tecnológica. Fundada originalmente como Escola de Aprendizes Artífices, em 1909, passou por diversas transformações até se tornar universidade tecnológica em 2005, sendo a primeira do Brasil com esse título.",
      "paragraph2": "Com sede em Curitiba, a UTFPR está presente em diversas cidades do Paraná, contando com 13 campus distribuídos pelo estado. Essa ampla presença regional contribui para o desenvolvimento local, promovendo acesso à educação superior de qualidade em diferentes áreas do conhecimento, com destaque para as engenharias, ciências exatas e tecnologia da informação.",
      "paragraph3": "A universidade oferece cursos de graduação, mestrado e doutorado, além de programas de extensão e pesquisa científica. Seu modelo educacional é voltado para a formação técnica e tecnológica, com foco na prática, na inovação e na aproximação com o setor produtivo. Esse perfil faz da UTFPR uma referência em formação profissional alinhada às demandas do mercado e da sociedade.",
      "paragraph4": "Além da qualidade acadêmica, a UTFPR valoriza a inclusão, a responsabilidade social e o desenvolvimento sustentável, promovendo projetos que beneficiam comunidades e incentivam o empreendedorismo. Seu compromisso com a ciência e com a formação cidadã contribui para o avanço tecnológico do país e para a construção de um futuro mais justo e inovador."
    }
  },

  "en": {
    "welcome": "Welcome to the TSI website!",
    "language": "Language",
    "navbar": {
      "search": "Search",
      "darkMode": "Dark Mode",
      "toggleNavigation": "Toggle navigation",
      "noResults": "No results found"
    },
    "routes": {
      "home": "Home",
      "about": "About",
      "contacts": "Contact Us"
    },
    "footer": {
      "title": "Federal University of Technology – Paraná (UTFPR)",
      "description": "UTFPR is a higher-education institution focused on technology and innovation, offering undergraduate, graduate, and research programs.",
      "contact": "Contact",
      "address": "R. Cristo Rei, 19 – Vila Becker, Toledo – PR, 85902-490",
      "phone": "+55  (45) 3379-6800",
      "email": "contato@utfpr.edu.br",
      "copyright": "© 2025 Federal University of Technology – Paraná. All rights reserved.",
      "socialMedia": {
        "whatsapp": "Link to WhatsApp",
        "twitter": "Link to Twitter",
        "youtube": "Link to YouTube",
        "instagram": "Link to Instagram",
        "facebook": "Link to Facebook",
        "linkedin": "Link to LinkedIn"
      }
    },
    "languageNames": {
      "pt": "Portuguese 🇧🇷",
      "en": "English 🇺🇸",
      "es": "Spanish 🇪🇸",
      "fr": "French 🇫🇷"
    },
    "aboutPage": {
      "title": "About the Program",
      "subtitle": "Curriculum Matrix",
      "paragraph1": "The Internet Systems Technology (TSI) program at UTFPR – Toledo Campus, launched in 2014, is a three-year (six-semester) undergraduate technology degree. It is completely tuition-free and has been officially recognized by the Brazilian Ministry of Education (MEC) since 2017.",
      "paragraph2": "Focused on the Information and Communication axis, the TSI program trains professionals capable of designing, implementing, and managing web systems, including interfaces, applications, electronic marketing, and intranets.",
      "paragraph3": "The curriculum, comprising approximately 2,400 hours, includes practical activities, supervised internship (360 hours), and a Final Course Project (TCC).",
      "paragraph4": "The program offers computer labs with dozens of workstations equipped for development, as well as support facilities such as physical and digital libraries, and individual and group study rooms. In 2023, the TSI program received a score of 4 (on a scale from 1 to 5) in the MEC evaluation, standing out for its didactic-pedagogical organization, qualified faculty (all holding master’s or doctoral degrees with significant scientific production), and high-quality infrastructure."
    },
    "contactPage": {
      "title": "Contact Us",
      "form": {
        "nameLabel": "Name",
        "namePlaceholder": "Enter your name",
        "emailLabel": "Email",
        "emailPlaceholder": "email@example.com",
        "subjectLabel": "Subject",
        "subjectPlaceholder": "Start the subject!",
        "submitButton": "Submit"
      }
    },
    "homePage": {
      "title": "What is UTFPR?",
      "paragraph1": "The Federal University of Technology – Paraná (UTFPR) is a public higher education institution nationally recognized for its excellence in education, research, and technological innovation. Originally founded as the School of Apprentice Craftsmen in 1909, it underwent several transformations before becoming a technological university in 2005, the first in Brazil to receive this title.",
      "paragraph2": "Headquartered in Curitiba, UTFPR is present in several cities across the state of Paraná, with 13 campuses distributed throughout the region. This broad regional presence contributes to local development by promoting access to high-quality higher education in various fields of knowledge, with a strong emphasis on engineering, exact sciences, and information technology.",
      "paragraph3": "The university offers undergraduate, master's, and doctoral programs, as well as extension initiatives and scientific research projects. Its educational model is focused on technical and technological training, emphasizing practical experience, innovation, and close ties with the productive sector. This approach makes UTFPR a benchmark in professional education aligned with the demands of the market and society.",
      "paragraph4": "In addition to academic excellence, UTFPR values inclusion, social responsibility, and sustainable development, promoting projects that benefit communities and encourage entrepreneurship. Its commitment to science and civic education contributes to the country’s technological advancement and to building a fairer and more innovative future."
    }
  },

  "es": {
    "welcome": "¡Bienvenido al sitio web de TSI!",
    "language": "Idioma",
    "navbar": {
      "search": "Buscar",
      "darkMode": "Modo Oscuro",
      "toggleNavigation": "Alternar navegación",
      "noResults": "No se encontraron resultados"
    },
    "routes": {
      "home": "Inicio",
      "about": "Acerca",
      "contacts": "Contáctanos"
    },
    "footer": {
      "title": "Universidad Tecnológica Federal de Paraná (UTFPR)",
      "description": "La UTFPR es una institución de educación superior enfocada en la tecnología y la innovación, ofreciendo programas de grado, posgrado e investigación.",
      "contact": "Contacto",
      "address": "R. Cristo Rei, 19 – Vila Becker, Toledo – PR, 85902-490",
      "phone": "+55 (45) 3379-6800",
      "email": "contato@utfpr.edu.br",
      "copyright": "© 2025 Universidad Tecnológica Federal de Paraná. Todos los derechos reservados.",
      "socialMedia": {
        "whatsapp": "Enlace a WhatsApp",
        "twitter": "Enlace a Twitter",
        "youtube": "Enlace a YouTube",
        "instagram": "Enlace a Instagram",
        "facebook": "Enlace a Facebook",
        "linkedin": "Enlace a LinkedIn"
      }
    },
    "languageNames": {
      "pt": "Portugués 🇧🇷",
      "en": "Inglés 🇺🇸",
      "es": "Español 🇪🇸",
      "fr": "Francés 🇫🇷"
    },
    "aboutPage": {
      "title": "Sobre el curso",
      "subtitle": "Matriz Curricular",
      "paragraph1": "El curso de Tecnología en Sistemas para Internet (TSI) de la UTFPR – Campus Toledo, iniciado en 2014, es una tecnicatura de 3 años de duración (6 semestres), totalmente gratuita y reconocida por el MEC desde 2017.",
      "paragraph2": "Enfocado en el eje de Información y Comunicación, el TSI forma profesionales capaces de diseñar, implementar y gestionar sistemas web, incluyendo interfaces, aplicaciones, marketing electrónico e intranets.",
      "paragraph3": "La matriz curricular, con aproximadamente 2.400 horas, incluye actividades prácticas, pasantía supervisada (360 horas) y un Trabajo de Fin de Curso (TFC).",
      "paragraph4": "El curso ofrece laboratorios de informática con decenas de estaciones equipadas para el desarrollo, además de una estructura de apoyo como biblioteca física y digital, y salas de estudio individuales y colectivas. En 2023, el TSI alcanzó una calificación de 4 (en una escala de 1 a 5) en la evaluación del MEC, destacándose por su organización didáctico-pedagógica, cuerpo docente calificado (todos con título de máster o doctor y producción científica relevante) y por su infraestructura de calidad."
    },
    "contactPage": {
      "title": "Contáctenos",
      "form": {
        "nameLabel": "Nombre",
        "namePlaceholder": "Escriba su nombre",
        "emailLabel": "Correo electrónico",
        "emailPlaceholder": "email@ejemplo.com",
        "subjectLabel": "Asunto",
        "subjectPlaceholder": "Ingrese el asunto!",
        "submitButton": "Enviar"
      }
    },
    "homePage": {
      "title": "¿Qué es la UTFPR?",
      "paragraph1": "La Universidad Tecnológica Federal de Paraná (UTFPR) es una institución pública de educación superior reconocida nacionalmente por su excelencia en educación, investigación e innovación tecnológica. Fundada originalmente como Escuela de Aprendices Artífices en 1909, pasó por diversas transformaciones hasta convertirse en universidad tecnológica en 2005, siendo la primera de Brasil con ese título.",
      "paragraph2": "Con sede en Curitiba, la UTFPR está presente en diversas ciudades de Paraná, contando con 13 campus distribuidos por todo el estado. Esta amplia presencia regional contribuye al desarrollo local, promoviendo el acceso a la educación superior de calidad en diferentes áreas del conocimiento, con énfasis en las ingenierías, ciencias exactas y tecnología de la información.",
      "paragraph3": "La universidad ofrece cursos de pregrado, maestría y doctorado, además de programas de extensión e investigación científica. Su modelo educativo está orientado a la formación técnica y tecnológica, con énfasis en la práctica, la innovación y la proximidad con el sector productivo. Este perfil convierte a la UTFPR en una referencia en formación profesional alineada con las demandas del mercado y la sociedad.",
      "paragraph4": "Además de la calidad académica, la UTFPR valora la inclusión, la responsabilidad social y el desarrollo sostenible, promoviendo proyectos que benefician a las comunidades e incentivan el emprendimiento. Su compromiso con la ciencia y la formación ciudadana contribuye al avance tecnológico del país y a la construcción de un futuro más justo e innovador."
    }
  },

  "fr": {
    "welcome": "Bienvenue sur le site de TSI !",
    "language": "Langue",
    "navbar": {
      "search": "Rechercher",
      "darkMode": "Mode Sombre",
      "toggleNavigation": "Basculer la navigation",
      "noResults": "Aucun résultat trouvé"
    },
    "routes": {
      "home": "Accueil",
      "about": "À propos",
      "contacts": "Contactez-nous"
    },
    "footer": {
      "title": "Université Fédérale de Technologie du Paraná (UTFPR)",
      "description": "L'UTFPR est une institution d'enseignement supérieur axée sur la technologie et l'innovation, offrant des cours de licence, de master et des programmes de recherche.",
      "contact": "Contact",
      "address": "R. Cristo Rei, 19 – Vila Becker, Toledo – PR, 85902-490",
      "phone": "(45) 3379-6800",
      "email": "contato@utfpr.edu.br",
      "copyright": "© 2025 Université Fédérale de Technologie du Paraná. Tous droits réservés.",
      "socialMedia": {
        "whatsapp": "Lien vers WhatsApp",
        "twitter": "Lien vers Twitter",
        "youtube": "Lien vers YouTube",
        "instagram": "Lien vers Instagram",
        "facebook": "Lien vers Facebook",
        "linkedin": "Lien vers LinkedIn"
      }
    },
    "languageNames": {
      "pt": "Portugais 🇧🇷",
      "en": "Anglais 🇺🇸",
      "es": "Espagnol 🇪🇸",
      "fr": "Français 🇫🇷"
    },
    "aboutPage": {
      "title": "À propos du cours",
      "subtitle": "Programme d'études",
      "paragraph1": "Le cours de Technologie des Systèmes Internet (TSI) de l'UTFPR – Campus Toledo, lancé en 2014, est un programme de technologue d'une durée de 3 ans (6 semestres), entièrement gratuit et reconnu par le MEC depuis 2017.",
      "paragraph2": "Axé sur le domaine de l'information et de la communication, le TSI forme des professionnels capables de concevoir, de mettre en œuvre et de gérer des systèmes web, y compris des interfaces, des applications, du marketing électronique et des intranets.",
      "paragraph3": "Le programme d'études, d'environ 2 400 heures, comprend des activités pratiques, un stage supervisé (360h) et un travail de fin d'études (TCC).",
      "paragraph4": "Le cours dispose de laboratoires informatiques avec des dizaines de stations de développement, ainsi que d'infrastructures de soutien telles qu'une bibliothèque physique et numérique, des salles d'étude individuelles et collectives. En 2023, le TSI a obtenu la note 4 (sur une échelle de 1 à 5) lors de l'évaluation du MEC, se distinguant par son organisation pédagogique, son corps enseignant qualifié (tous titulaires d’un master ou d’un doctorat avec une production scientifique pertinente) et par son infrastructure de qualité."
    },
    "contactPage": {
      "title": "Contactez-nous",
      "form": {
        "nameLabel": "Nom",
        "namePlaceholder": "Entrez votre nom",
        "emailLabel": "Email",
        "emailPlaceholder": "email@exemple.com",
        "subjectLabel": "Sujet",
        "subjectPlaceholder": "Saisissez le sujet",
        "submitButton": "Envoyer"
      }
    },
    "homePage": {
      "title": "Qu'est-ce que l'UTFPR ?",
      "paragraph1": "L'Université Fédérale de Technologie du Paraná (UTFPR) est une institution publique d'enseignement supérieur reconnue au niveau national pour son excellence en éducation, en recherche et en innovation technologique. Fondée initialement comme École d'Apprentis Artisans en 1909, elle a subi plusieurs transformations jusqu'à devenir une université technologique en 2005, la première du genre au Brésil.",
      "paragraph2": "Basée à Curitiba, l'UTFPR est présente dans plusieurs villes du Paraná, avec 13 campus répartis dans tout l'État. Cette présence régionale contribue au développement local, en offrant un accès à un enseignement supérieur de qualité dans divers domaines, notamment les ingénieries, les sciences exactes et les technologies de l'information.",
      "paragraph3": "L'université propose des cours de licence, de master et de doctorat, ainsi que des programmes d'extension et de recherche scientifique. Son modèle éducatif est axé sur la formation technique et technologique, mettant l'accent sur la pratique, l'innovation et la proximité avec le secteur productif. Ce profil fait de l'UTFPR une référence dans la formation professionnelle adaptée aux besoins du marché et de la société.",
      "paragraph4": "Outre la qualité académique, l'UTFPR valorise l'inclusion, la responsabilité sociale et le développement durable, en promouvant des projets qui bénéficient aux communautés et encouragent l'entrepreneuriat. Son engagement envers la science et la formation citoyenne contribue à l'avancement technologique du pays et à la construction d'un avenir plus juste et innovant."
    }
  }
}
